  
```sql

-- 1.查询课程编号为“01”的课程比“02”的课程成绩高的所有学生的学号（重点）



-- 2、查询平均成绩大于60分的学生的学号和平均成绩（简单，第二道重点）



-- 3、查询所有学生的学号、姓名、选课数、总成绩（不重要）



-- 4、查询姓“猴”的老师的个数（不重要）


 
-- 5、查询没学过“张三”老师课的学生的学号、姓名（重点）



-- 6、查询学过“张三”老师所教的所有课的同学的学号、姓名（重点）



-- 7、查询学过编号为“01”的课程并且也学过编号为“02”的课程的学生的学号、姓名（重点）



-- 8、查询课程编号为“02”的总成绩（不重点）



-- 9、查询所有课程成绩小于60分的学生的学号、姓名



-- 10.查询没有学全所有课的学生的学号、姓名(重点)


-- 11、查询至少有一门课与学号为“01”的学生所学课程相同的学生的学号和姓名（重点）



-- 12.查询和“01”号同学所学课程完全相同的其他同学的学号(重点)



-- 13、查询没学过"张三"老师讲授的任一门课程的学生姓名 和47题一样（重点，能做出来）



-- 15、查询两门及其以上不及格课程的同学的学号，姓名及其平均成绩（重点）



-- 16、检索"01"课程分数小于60，按分数降序排列的学生信息（和34题重复，不重点）



-- 17、按平均成绩从高到低显示所有学生的所有课程的成绩以及平均成绩(重重点与35一样)



-- 18.查询各科成绩最高分、最低分和平均分：以如下形式显示：
-- 课程ID，课程name，最高分，最低分，平均分，及格率，中等率，优良率，优秀率
-- 及格为>=60，中等为：70-80，优良为：80-90，优秀为：>=90 (超级重点)


-- 19、按各科成绩进行排序，并显示排名(重点row_number)



-- 20、查询学生的总成绩并进行排名（不重点） 



-- 21 、查询不同老师所教不同课程平均分从高到低显示(不重点)



-- 22、查询所有课程的成绩第2名到第3名的学生信息及该课程成绩（重要 25类似）



-- 23、使用分段[100-85],[85-70],[70-60],[<60]来统计各科成绩，
-- 分别统计各分数段人数：课程ID和课程名称(重点和18题类似)



-- 24、查询学生平均成绩及其名次（同19题，重点）



-- 25、查询各科成绩前三名的记录（不考虑成绩并列情况）（重点 与22题类似）



-- 26、查询每门课程被选修的学生数(不重点)



-- 27、 查询出只有两门课程的全部学生的学号和姓名(不重点)



-- 28、查询男生、女生人数(不重点)



-- 29 查询名字中含有"风"字的学生信息（不重点）



-- 31、查询1990年出生的学生名单（重点year）



-- 32、查询平均成绩大于等于85的所有学生的学号、姓名和平均成绩（不重要）



-- 33、查询每门课程的平均成绩，结果按平均成绩升序排序，平均成绩相同时，按课程号降序排列（不重要）



-- 34、查询课程名称为"数学"，且分数低于60的学生姓名和分数（不重点）



-- 35、查询所有学生的课程及分数情况（重点）



-- 36、查询任何一门课程成绩在70分以上的姓名、课程名称和分数（重点）



-- 37、查询不及格的课程并按课程号从大到小排列(不重点)



-- 38、查询课程编号为03且课程成绩在80分以上的学生的学号和姓名（不重要）



-- 39、求每门课程的学生人数（不重要）



-- 40、查询选修“张三”老师所授课程的学生中成绩最高的学生姓名及其成绩（重要top）



-- 41.查询不同课程成绩相同的学生的学生编号、课程编号、学生成绩 （重点）



-- 42、查询每门功成绩最好的前两名（同22和25题）



-- 43、统计每门课程的学生选修人数（超过5人的课程才统计）。
-- 要求输出课程号和选修人数，查询结果按人数降序排列，若人数相同，按课程号升序排列（不重要）



-- 44、检索至少选修两门课程的学生学号（不重要）



-- 45、 查询选修了全部课程的学生信息（重点划红线地方）



-- 46、查询各学生的年龄（精确到月份）



-- 47、查询没学过“张三”老师讲授的任一门课程的学生姓名



-- 48、查询两门以上不及格课程的同学的学号及其平均成绩



-- 49、查询各学生的年龄（精确到月份）



-- 50、查询本月过生日的学生
 

```
